# Assignment 2 (Week 2)

>**Note**: Late submissions are ***`penalized`***.

## Name: FAIZA YUSUF

In [4]:
import pandas as pd
import sqlite3

In [2]:
%load_ext sql

In [5]:
%sql sqlite:///week_2.db

### The Database can be found [here](https://drive.google.com/file/d/1uIPkJWIHyZ8iQD_tQlM_K-ANoT_Bpy8P/view?usp=sharing)

> Run the command below to see all the tables present in the SQLite DB.

```sql
SELECT name FROM sqlite_master;
```

<hr>
<br>

In [13]:
%%sql
SELECT name FROM sqlite_master;

 * sqlite:///week_2.db
Done.

[('customers',),
 ('sqlite_sequence',),
 ('orders',),
 ('employee',),
 ('department',),
 ('students',),
 ('sqlite_autoindex_students_1',),
 ('products',)]

## Qs 1: 

a. Given the table, `customers` and `orders` shown below, use a **subquery** to find the **customers** that did ***NOT*** place any orders. Display only the customer name(s).

**`customers`**

![image.png](https://i.postimg.cc/sx2WK6v3/image.png)


**`orders`**

![image.png](https://i.postimg.cc/T2H5fcKW/image.png)

b. Given the `products` table shown below:

[![image.png](https://i.postimg.cc/W18dpLXC/image.png)](https://postimg.cc/DSWv5DVP)

write a query that returns the price of each product at every store. Your result should look like this:

[![image.png](https://i.postimg.cc/s235K4Nd/image.png)](https://postimg.cc/FYnfH3vD)

**Hint:** Use `CASE` statement.

### NOTE: You must use a single query.

In [ ]:
#1a

In [8]:
%%sql
SELECT a.name FROM customers a
JOIN orders b
ON a.id = b.id
WHERE order_id is null

 * sqlite:///week_2.db
Done.

[('Afam',), ('Deborah',)]

In [ ]:
#1b

In [238]:
%%sql
select a.id, store_a, store_b, store_c
From (
    SELECT id, store_a 
    FROM (
          SELECT  id,
      CASE 
          WHEN store = "store a" THEN price 
          END AS store_a,
      CASE
          WHEN store = "store b" THEN price 
          END AS store_b,
      CASE
          WHEN store = "store c" THEN price 
          END AS store_c
          FROM products
     where store_a is not null)) a
join ( 
    SELECT id, store_b 
    FROM (
          SELECT  id,
      CASE 
          WHEN store = "store a" THEN price 
          END AS store_a,
      CASE
          WHEN store = "store b" THEN price 
          END AS store_b,
      CASE
          WHEN store = "store c" THEN price 
          END AS store_c
          FROM products
     where store_b is not null)) b
on a.id = b.id 
join (
    SELECT id, store_c
FROM (
          SELECT  id,
      CASE 
          WHEN store = "store a" THEN price 
          END AS store_a,
      CASE
          WHEN store = "store b" THEN price 
          END AS store_b,
      CASE
          WHEN store = "store c" THEN price 
          END AS store_c
          FROM products
     where store_c is not null))c
on a.id = c.id

 * sqlite:///week_2.db
Done.

[(0, 10, 11, 12), (1, 33, 35, 34)]

In [ ]:
#or

In [241]:
%%sql
with case_query as (
    SELECT  id,
      CASE 
          WHEN store = "store a" THEN price 
          END AS store_a,
      CASE
          WHEN store = "store b" THEN price 
          END AS store_b,
      CASE
          WHEN store = "store c" THEN price 
          END AS store_c
          FROM products
             )
select a.id, store_a, store_b, store_c
From (
    SELECT id, store_a 
    FROM case_query
     where store_a is not null) a
join ( 
    SELECT id, store_b 
    FROM case_query
     where store_b is not null) b
on a.id = b.id 
join (
    SELECT id, store_c
FROM case_query
     where store_c is not null)c
on a.id = c.id

 * sqlite:///week_2.db
Done.

[(0, 10, 11, 12), (1, 33, 35, 34)]

## Qs 2: 

Given the tables `employee` and `department` shown below:

![image.png](https://i.postimg.cc/bw0J574p/image.png)

a. Write a query that generates the table shown below:

![image](https://i.postimg.cc/hjc3rdTK/image.pnghttps://i.postimg.cc/hjc3rdTK/image.png)

b. Write a query that determines the **highest earner** in **each department**.

c. Write a query that shows all the employees in each department **except** the **lowest earner**. i.e generate the table below

![image.png](https://i.postimg.cc/MHcmw7Q0/image.png)

In [ ]:
#2a

In [72]:
%%sql
SELECT a.name, a.salary, b.dept_name
FROM employee a
JOIN department b
ON a.dept_id = b.id
ORDER BY dept_name;

 * sqlite:///week_2.db
Done.

[('Felix', 33000, 'IT'),
 ('Okafor', 25000, 'IT'),
 ('Gafar', 41000, 'IT'),
 ('Amanda', 53000, 'IT'),
 ('Steve', 32000, 'Sales'),
 ('Bola', 31000, 'Sales'),
 ('Babalola', 30200, 'Sales'),
 ('Adigun', 30000, 'Sales')]

In [ ]:
#2b

In [251]:
%%sql
WITH the_product AS
   (SELECT a.name, a.salary, b.dept_name
        FROM employee a
        JOIN department b
        ON a.dept_id = b.id)
select name, max(salary) salary, dept_name from the_product
group by dept_name;

 * sqlite:///week_2.db
Done.

[('Amanda', 53000, 'IT'), ('Steve', 32000, 'Sales')]

In [ ]:
#2c

In [260]:
%%sql
select z.name, z.salary, z.dept_name 
from (
      SELECT a.name, a.salary, b.dept_name
      FROM employee a
      JOIN department b
      ON a.dept_id = b.id
      ORDER BY dept_name) z
join (
    WITH the_product AS
   (SELECT a.name, a.salary, b.dept_name
        FROM employee a
        JOIN department b
        ON a.dept_id = b.id)
select name, max(salary) salary, dept_name from the_product
group by dept_name)y
on z.dept_name = y.dept_name
where z.salary != y.salary
order by z.dept_name

 * sqlite:///week_2.db
Done.

[('Felix', 33000, 'IT'),
 ('Okafor', 25000, 'IT'),
 ('Gafar', 41000, 'IT'),
 ('Bola', 31000, 'Sales'),
 ('Babalola', 30200, 'Sales'),
 ('Adigun', 30000, 'Sales')]

### Qs 3: Given the students table:

a. Write a query that creates a new column `percentage_score`.  The `percentage_score` is the mean of all the subjects for each student. Round the `percentage_score` to 2 decimal points and sort in descending order.

b. Write a query that selects **ONLY** the students that scored more than the mean of the `percentage_score`.

In [ ]:
#3a

In [188]:
%%sql 
SELECT *, ROUND(((maths + english + physics)/3), 2) AS percentage_score FROM students
ORDER BY percentage_score DESC;

 * sqlite:///week_2.db
Done.

[('ux-012-013', 'Emeka', 'M', 95, 84, 94, 91.0),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85, 88.0),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91, 87.0),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88, 79.0),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78, 75.0),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70, 72.0),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77, 71.0),
 ('ux-012-019', 'Steve', 'M', 61, 69, 72, 67.0),
 ('ux-012-024', 'Seyi', 'M', 54, 83, 63, 66.0),
 ('ux-012-021', 'Samantha', 'F', 52, 69, 48, 56.0),
 ('ux-012-022', 'Philip', 'M', 51, 39, 45, 45.0),
 ('ux-012-017', 'Fred', 'M', 28, 57, 39, 41.0)]

In [ ]:
#3b

In [186]:
%%sql
SELECT *, ROUND(((maths + english + physics)/3), 2) AS percentage_score FROM students
WHERE percentage_score > (
                           SELECT ROUND(AVG(percentage_score),2) average_percentage_score
                           FROM (SELECT *, ROUND(((maths + english + physics)/3), 2) AS percentage_score FROM students
                           ORDER BY percentage_score DESC) temp
                          )
ORDER BY percentage_score DESC;

 * sqlite:///week_2.db
Done.

[('ux-012-013', 'Emeka', 'M', 95, 84, 94, 91.0),
 ('ux-012-020', 'Ahmed', 'M', 87, 94, 85, 88.0),
 ('ux-012-016', 'Esther', 'F', 93, 77, 91, 87.0),
 ('ux-012-014', 'Agnes', 'F', 80, 69, 88, 79.0),
 ('ux-012-018', 'Ogechi', 'F', 80, 69, 78, 75.0),
 ('ux-012-023', 'Dave', 'M', 77, 69, 70, 72.0),
 ('ux-012-015', 'Alimat', 'F', 69, 69, 77, 71.0)]